{"pageProps":{"frontmatter":{"title":"Canary Release vs Blue-Green Deployments.","date":"July 30 2021","reading_time":"3 min read","post_logo":"https://media-exp1.licdn.com/dms/image/C4D0BAQHca9scvFTn_g/company-logo_200_200/0/1575039115252?e=2159024400&v=beta&t=lhQfV9RKT_iydx97uugwZtvsL_zgPoTU_fxFC11nkaI","preview":"Choosing the right deployment strategy is crucial to the availability and quality of your services.  Two of the most known deployment strategies are blue/green deployment and canary release. This article discusses both deployment strategies. It explores the differences between the two, the pros and cons of each one, and finally the best use case for each of them.","category":"Advanced Techniques","app":"CI/CD","type":"pipeline"},"slug":"canary-release-vs-blue-green-deployments","content":"\nChoosing the right deployment strategy is crucial to the availability and quality of your services.  Two of the most known deployment strategies are blue/green deployment and canary release. \n\nThis article discusses both deployment strategies. It explores the differences between the two, the pros and cons of each one, and finally the best use case for each of them.\n\nDowntimes when updating applications have now become a concept of the past. Users expect the introduction of new application versions to be a seamless process that doesn’t interrupt their experience. Canary release and blue-green deployment strategies both overcome the possibility of updates’ related downtime problems. \n\nIn this article, we’ll discuss each strategy’s approach to the upgrade process, its strengths,  shortcomings, and best use cases.\n\n## What is Canary Release?\n\nCanary release is a deployment rollout strategy that aims at minimizing new software risks by directing a small percentage of users to the new version of the application. After verifying that the new application works as intended, the traffic directed to it is gradually increased and eventually, all traffic is directed to it. \n\nIn case an issue is detected at any point throughout the deployment, a rollback is performed with ease because both the current and the new versions are in the production environment. \n\n![How canary release works](https://s3.us-west-2.amazonaws.com/secure.notion-static.com/628dd956-2a2f-4346-9327-ba5b64b3e739/Canary_Release.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAT73L2G45O3KS52Y5%2F20210729%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20210729T093307Z&X-Amz-Expires=86400&X-Amz-Signature=180c657451e1a6cd7311417e17be4e9d1823d7e9a4001e8936617f23d2e68040&X-Amz-SignedHeaders=host&response-content-disposition=filename%20%3D%22Canary_Release.png%22)\n\nHow canary release works\n\n## What is **Blue-Green Deployment?**\n\nBlue-Green Deployment is a deployment strategy aimed at minimizing the chance for lags or downtime. It does this by creating a production environment, that is identical to the environment that the live version is running on. The new version of the application is then deployed in the newly created environment. Blue environment refers to the environment of the old version, and green environment refers to the new version’s environment.\n\nThis strategy allows developers to thoroughly test the new version in a production environment before gradually directing user traffic to it. After the migration of user traffic is complete, the old version is kept intact in case there is a need for rollback or disaster recovery.\n\n![How blue-green deployment works](https://s3.us-west-2.amazonaws.com/secure.notion-static.com/53c56e4c-30cf-4939-906d-75e7354ab0f8/Blue-green_deployment_before__after_cutover.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAT73L2G45O3KS52Y5%2F20210729%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20210729T093454Z&X-Amz-Expires=86400&X-Amz-Signature=5d43a2a7d9de842f33ff59613831ab1ace40a567b01ea708dad1c88b6fbf1db7&X-Amz-SignedHeaders=host&response-content-disposition=filename%20%3D%22Blue-green_deployment_before__after_cutover.png%22)\n\nHow blue-green deployment works\n\n## Differences between Cary Release and Blue-Green Deployment\n\nThere are several differences between these two strategies in how they approach the deployment process. These are the most important ones:\n\n- In blue-green deployment, a second identical production environment needs to be created but the canary release works on the existing one.\n- Secondly, unlike the canary release blue-green deployment allows for unlimited testing in the production environment.\n- With the canary release, you can target a specific subset of users randomly or using a set criterion. This is not possible with a blue-green deployment strategy.\n\n## **Blue-Green Deployment Pros and Cons**\n\nThis type of deployment is more efficient in some cases but falls short in others. Below are some of this strategy’s pros and cons.\n\n### **Pros of blue-green deployment**\n\nFirst, it allows testing the new version in a production environment without impacting the live one. This is important when you have major updates that take a lot of time to test thoroughly. Secondly, instant cutover switching ensures that traffic is moved to the new version instantly and everyone sees the new release without any lag. Finally, it lessens the chances of downtime or lags during deployment because the old version is available in case a rollback is needed.\n\n### **Cons of blue-green deployment**\n\nFirst, during the cutover, users’ requests can be dropped. This can be a problem, especially if the request was a transaction because the request might have already been recorded in the database before being dropped. The other shortcoming of this strategy is that, unlike the canary release, this method gives the developer minimal traffic scaling control during the deployment process. Thirdly, it is expensive and claims some time from the DevOps team to set up. This is because a new environment that takes a lot of resources like the first environment has to be set up. Finally, the process of managing the database during the cutover is very difficult and requires complex schemas adjustments.\n\n## **Canary Release**\n\nThis strategy is widely used due to the benefits that it offers to developers in many use cases. Below are the benefits it offers and its shortcomings.\n\n### **Pros of canary release**\n\nFirst, it gives a lot of control in the distribution of traffic between the new and the old deployment. For instance, you can choose the percentage, and also create a subset of users based on factors such as location or account types. Secondly, it reduces the chances of a system failure by providing a rollback option in case the new version has issues. Thirdly, it gives a chance to learn how a small group of users is reacting to the new version of the application. The data from that small group can be used to understand how the users will react after the full rollout. Another advantage of this strategy is that it is not limited in terms of platform compatibility. You can use it to deploy applications on mobile, website, or desktop platforms. Finally, it can be deployed on hybrid software solutions that combine native and web applications.\n\n### **Cons of canary release**\n\nThe first shortcoming is that, unlike the blue-green deployment, you don’t get a chance to test the new version in an identical production environment. The other one is that, managing a database and its operations during canary deployment is very difficult and when not well handled can lead to data loss or duplication. To be able to run the two versions of releases, the database will need to be adjusted to handle two instances of the same application. Unless you implement this successfully, requests from one of the versions may be dropped because the database denies it access.\n\n## Best Use Cases\n\n**Blue-green deployment** is most effective when you have an application that will receive major updates with the new version. This is because the method requires a higher budget to implement due to the creation of an identical deployment environment.\n\nWhen a company has a policy of releasing major updates at specified intervals, it is important to have a testing platform capable of handling all types of tests in the production environment. This will allow them to fix the bugs that would be a nuisance to the users before they are introduced to the new version.\n\n**Canary deployment** is most effective in cases where there are regular rollouts due to the high frequency of updates. This is because it doesn’t require expensive infrastructure to implement smoothly. It is also effective in testing out a new feature that has been developed before making the decision on whether to fully deploy it to all users. The flexibility in targeting a subset of users based on a set criterion provides an opportunity for the collection of more meaningful data leading to better insight.\n\n## Summary\n\nIn sum, when rolling out a new version of your software, it is important to make sure that there is minimal chance of downtimes or lags. This can be achieved by using rollout methods that allow for instant rollbacks in case there is an issue with the new version. Canary release and blue-green deployment enable developers to achieve this by allowing for gradual rollout with the backup option ready to be fully engaged. However, the two methods approach the rollout process differently, and each method has its best use scenarios. Canary release is best for undertaking frequent updates while the blue-green method is best for rolling out significant upgrades.\n\n## Start deploying your cloud-native apps today\n\nUse [Wildcard](https://www.w6d.io/) to implement a zero-downtime strategy with ease. With our hassle-free platform, you don’t have to be a DevOps engineer to continuously test and deliver your cloud-native apps. [Try it now, it's free!](https://www.w6d.io/)","posts":[{"slug":"a-quick-introduction-to-cicd","frontmatter":{"title":"A quick introduction to CI/CD.","date":"July 29 2021","reading_time":"5 min read","post_logo":"https://media-exp1.licdn.com/dms/image/C4D0BAQHca9scvFTn_g/company-logo_200_200/0/1575039115252?e=2159024400&v=beta&t=lhQfV9RKT_iydx97uugwZtvsL_zgPoTU_fxFC11nkaI","preview":"CI/CD is one of the pillars of modern cloud native software development. It improves your software products and makes its development more effective and cheaper This article discusses CI/CD and the different tools you can use to implement it.","category":"Advanced Techniques","app":"CI/CD","type":"pipeline"}},{"slug":"canary-release-vs-blue-green-deployments","frontmatter":{"title":"Canary Release vs Blue-Green Deployments.","date":"July 30 2021","reading_time":"3 min read","post_logo":"https://media-exp1.licdn.com/dms/image/C4D0BAQHca9scvFTn_g/company-logo_200_200/0/1575039115252?e=2159024400&v=beta&t=lhQfV9RKT_iydx97uugwZtvsL_zgPoTU_fxFC11nkaI","preview":"Choosing the right deployment strategy is crucial to the availability and quality of your services.  Two of the most known deployment strategies are blue/green deployment and canary release. This article discusses both deployment strategies. It explores the differences between the two, the pros and cons of each one, and finally the best use case for each of them.","category":"Advanced Techniques","app":"CI/CD","type":"pipeline"}},{"slug":"release-of-mongodb","frontmatter":{"title":"Release of MongoDB","date":"April 11 2021","reading_time":"2 min read","excerpt":"Test excerpt","post_logo":"https://emanueleciriachi.net/wp-content/uploads/2019/01/logo-mongodb-png-mongodb-logo-png-400.png","category":"Databases","app":"MongoDB","type":"database","preview":"MongoDB’s first version of the database shipped in August 2009. The 1.0 release and those that followed shortly after were focused on validating a new and largely unproven approach to database design – built on a document-oriented data model and layered onto an elastic and distributed systems foundation. Those early MongoDB releases attracted masses of adoption across startups and enterprises alike."}},{"slug":"wildcard-ensures-security-privacy-and-compliance","frontmatter":{"title":"Wildcard ensures security, privacy and compliance.","date":"April 10 2021","reading_time":"1 min read","excerpt":"Test excerpt","post_logo":"https://media-exp1.licdn.com/dms/image/C4D0BAQHca9scvFTn_g/company-logo_200_200/0/1575039115252?e=2159024400&v=beta&t=lhQfV9RKT_iydx97uugwZtvsL_zgPoTU_fxFC11nkaI","preview":"When you register to our platform, your personal information is safely stored in our database, and to our marketing automation platform. Nobody except us, Wildcard collaborators, have access to this data. Your personal information will only be used according to the rights you have granted and may include automatic emails to accompany the experience on Wildcard, weekly newsletter or casual information emails on Widcard’s solution and features.","category":"Security","app":"Wildcard","type":"security"}},{"slug":"wildcard-officially-becomes-owner-and-collaborator-of-babelfish","frontmatter":{"title":"Wildcard officially becomes owner and collaborator of Babelfish","date":"April 14 2021","reading_time":"2 min read","post_logo":"https://images-platform.99static.com/ZVAAzy__FeP9nrM-42Sbj75AjpI=/0x0:1001x1001/500x500/top/smart/99designs-contests-attachments/84/84527/attachment_84527709","preview":"Babelfish is a self-hosted server for source-code parsing: it has the power to parse all kinds of file, in any supported language, extracting an Abstract Syntax Tree and converting it into a Universal Abstract Syntax Tree (UAST). This UAST enables further analysis and transformations with either the included tools or your own tools by providing a standard open format.","category":"Advanced Techniques","app":"Babelfish","type":"server"}},{"slug":"wildcard-officially-becomes-owner-and-collaborator-of","frontmatter":{"title":"Wildcard officially becomes owner and collaborator of Babelfish","date":"March 23 2021","reading_time":"2 min read","excerpt":"Test excerpt","post_logo":"https://images-platform.99static.com/ZVAAzy__FeP9nrM-42Sbj75AjpI=/0x0:1001x1001/500x500/top/smart/99designs-contests-attachments/84/84527/attachment_84527709","preview":"Babelfish is a self-hosted server for source-code parsing: it has the power to parse all kinds of file, in any supported language, extracting an Abstract Syntax Tree and converting it into a Universal Abstract Syntax Tree (UAST). This UAST enables further analysis and transformations with either the included tools or your own tools by providing a standard open format.","category":"Advanced Techniques","app":"Babelfish","type":"server"}}]},"__N_SSG":true}